app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
---
<h2>Comments</h2>
<% @article.comments.each do |comment| %>