app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "This permit?º"], ["body", "idk, but i'll try"], ["created_at", "2024-01-22 23:18:57.017141"], ["updated_at", "2024-01-22 23:18:57.017141"], ["status", nil]]

  def update
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]