app/controllers/comments_controller.rb

    def create
        @article = Article.find(params[:article_id])
        @comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "test"], ["body", "test"], ["article_id", 3], ["created_at", "2024-01-24 00:51:56.467546"], ["updated_at", "2024-01-24 00:51:56.467546"], ["status", "public"]]